glcloud/keil_v5/ARM/PACK/.Web/AnalogDevices.ADuCM4x50_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>AnalogDevices</vendor>
  <name>ADuCM4x50_DFP</name>
  <description>Analog Devices ADuCM4x50 Device Support. (Subject to the Software License Agreement referred to in the Release Notes.)</description>
  <url>http://download.analog.com/tools/EZBoards/ADuCM4050/Releases/</url>
  <supportContact>http://www.analog.com/en/support/technical-support.html</supportContact>
  <license>License/2017-02-16-CM4x50EZDFP Click Thru SLA.txt</license>

  <releases>
    <release version="3.2.0"  date="2018-08-03">
      API extension for RTC driver.
      Bug fixes for RTC, SPI and UART drivers.
    </release>
    <release version="3.1.2"  date="2018-04-11">
      GPIO driver API extended with adi_gpio_GroupInterruptPolarityEnable to determine if the interrupts are generated
      on the rising or falling edge of the corresponding GPIO pin.
      RTC driver modified to eliminate the risks of counter overflows.
      Software work around for anomaly 2100023, an anomaly that can impact RTC registers read accesses on ADuCM4050 si. rev.  0.0.
      RTOS mapping extended with Micrium uC/OS-II.
      UART driver updated for PIO Rx transfers to support all the FIFO trigger levels.
    </release>
    <release version="3.1.0"  date="2018-01-22">
      Further version synchronization across IoT CMSIS Pack products
      Flash controller driver default settings updated.
    </release>
    <release version="3.0.0"  date="2017-10-31">
      Version synchronization across IoT CMSIS Pack products
    </release>
    <release version="1.1.0"  date="2017-10-16">
      New APIs and fixes to drivers
      - Crypto driver extended with HMAC in PKSTOR support
      - Support to set the priority for all IRQ interrupts to a default value
        different from 0 (1 by default) when using FreeRTOS.
        The default priority value, ADI_MAX_IRQ_PRIORITY, can be found in file
        Include\rtos_map\adi_rtos_map_freertos.h.
      - FLash driver API extended to support wait states configuration
      - GPIO driver API extended to read group interrupt and output information, and
        to enable/disable increased drive strength capability
      - Fix issues in PWR driver
      - RTC driver API extended with functions to get and clear interrupt status
      - SPI driver API extended with functions to set clock phase and polarity
    </release>
    <release version="1.0.0"  date="2017-03-09">
      Initial Release
    </release>
  </releases>

  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="5.3.0"/>
    </packages>
  </requirements>

  <boards>
    <board vendor="AnalogDevices" name="ADuCM4050 EZ-KIT" revision="Ver 1.0">
      <description>Analog Devices ADuCM4050 Evaluation Board</description>
      <mountedDevice    deviceIndex="0" Dvendor="Analog Devices:1" Dname="ADuCM4050"/>
      <compatibleDevice deviceIndex="0" Dvendor="Analog Devices:1" Dfamily="ADuCM4050 Series"/>
      <feature type="PWR"             n="5"              name="External 5.0VDC/3.6A power supply"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
    </board>
  </boards>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Analog Devices</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Analog Devices</keyword>
    <keyword>ADuCM4x50</keyword>
    <keyword>ADuCM4050</keyword>
  </keywords>

  <devices>
    <family Dfamily="ADuCM4x50 Series" Dvendor="Analog Devices:1">
      <description>
        The ADuCM4050 processor is an ultra low-power integrated mixed-signal microcontroller system for processing, control and connectivity. The MCU system is based on the ARM Cortex-M4F processor. The MCU also has a collection of digital peripherals, embedded SRAM and flash memory, and an analog subsystem which provides clocking, reset, and power manage-ment capability in addition to an ADC subsystem.
      </description>

      <environment name="uv">
        <CMisc>--C99</CMisc>
        <AMisc>--cpreproc --cpreproc_opts=-U__STDC__,-D__ASSEMBLER__</AMisc>
      </environment>

      <environment name="cces">
        <properties>
          <property name="toolchain" value="arm.gcc.toolchain"/>
          <property name="gdb-qemu" value="false"/>
        </properties>

        <silicon-revisions command-line-default="0.1">
          <silicon revision="none"/>
          <silicon revision="0.1"/>
          <silicon revision="any"/>
        </silicon-revisions>
      </environment>

      <!-- ******************************  ADuCM4050  ****************************** -->
      <device Dname="ADuCM4050">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="52000000"/>
        <environment name="iar">
          <file category="i79file" name="ARM/config/devices/AnalogDevices/ADuCM4050.i79" />
        </environment>
        <debug      svd="SVD/ADuCM4050.svd"/>
        <algorithm  name="Flash/ADuCM4x50.FLM"      start="0x00000000"  size="0x7F000"  default="1"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x7F000"  startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x04000"  init   ="1"   default="1"/>
        <memory     id="IRAM2"                      start="0x20040000"  size="0x14000"  init   ="0"   default="1"/>
        <compile header="Include/ADuCM4050.h"  define="__ADUCM4050__"/>
      </device>
    </family>
  </devices>

  <conditions>
    <condition id="ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="GCC">
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="IAR">
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="ADuCM4x50">
      <description>ADuCM4x50 device</description>
      <require Dvendor="Analog Devices:1"/>
      <accept Dname="ADuCM4050"/>
    </condition>
